ahtn/keyplus/efm8/efm8/mcu/C8051F911/inc/SI_C8051F911_Register_Enums.h
#define DC0CF_VDDSLP__BMASK          0x02 ///< VDD/DC+ Sleep Mode Connection                     
#define DC0CF_VDDSLP__SHIFT          0x01 ///< VDD/DC+ Sleep Mode Connection                     
#define DC0CF_VDDSLP__VBAT           0x00 ///< VDD/DC+ connected to VBAT in Sleep Mode.          
#define DC0CF_VDDSLP__FLOATING       0x02 ///< VDD/DC+ is floating in Sleep Mode.                
                                                                                                 
#define DC0CF_ILIMIT__BMASK          0x04 ///< Peak Current Limit Threshold                      
#define DC0CF_ILIMIT__SHIFT          0x02 ///< Peak Current Limit Threshold                      
#define DC0CF_ILIMIT__MODE0          0x00 ///< If SWSEL is 1, the current limit is 100 mA in     
                                          ///< normal mode and 75 mA in low power mode. If SWSEL 
                                          ///< is 0, the current limit is 250 mA in normal mode  
                                          ///< and 125 mA in low power mode.                     
#define DC0CF_ILIMIT__MODE1          0x04 ///< If SWSEL is 1, the current limit is 125 mA in     
                                          ///< normal mode and 100 mA in low power mode. If SWSEL
                                          ///< is 0, the current limit is 500 mA in normal mode  
                                          ///< and 250 mA in low power mode.                     
                                                                                                 
#define DC0CF_CLKINV__BMASK          0x08 ///< DC-DC Converter Clock Invert                      
#define DC0CF_CLKINV__SHIFT          0x03 ///< DC-DC Converter Clock Invert                      
#define DC0CF_CLKINV__NOT_INVERTED   0x00 ///< The dc-dc converter clock is inverted.            
#define DC0CF_CLKINV__INVERTED       0x08 ///< The dc-dc converter clock is not inverted.        
                                                                                                 
#define DC0CF_AD0CKINV__BMASK        0x10 ///< ADC0 Clock Inversion (Clock Invert During Sync)   
#define DC0CF_AD0CKINV__SHIFT        0x04 ///< ADC0 Clock Inversion (Clock Invert During Sync)   
#define DC0CF_AD0CKINV__INVERTED     0x00 ///< ADC0 SAR clock is inverted.                       
#define DC0CF_AD0CKINV__NOT_INVERTED 0x10 ///< ADC0 SAR clock is not inverted.                   
                                                                                                 
#define DC0CF_CLKDIV__FMASK          0x60 ///< DC-DC Clock Divider                               
#define DC0CF_CLKDIV__SHIFT          0x05 ///< DC-DC Clock Divider                               
#define DC0CF_CLKDIV__SYSCLK_DIV_1   0x00 ///< The dc-dc converter clock is system clock divided 
                                          ///< by 1.                                             
#define DC0CF_CLKDIV__SYSCLK_DIV_2   0x20 ///< The dc-dc converter clock is system clock divided 
                                          ///< by 2.                                             
#define DC0CF_CLKDIV__SYSCLK_DIV_4   0x40 ///< The dc-dc converter clock is system clock divided 
                                          ///< by 4.                                             
#define DC0CF_CLKDIV__SYSCLK_DIV_8   0x60 ///< The dc-dc converter clock is system clock divided 
                                          ///< by 8.                                             
                                                                                                 
//------------------------------------------------------------------------------
// DC0CN Enums (DC-DC Converter Control @ 0x97)
//------------------------------------------------------------------------------
#define DC0CN_VSEL__FMASK       0x07 ///< DC-DC Converter Output Voltage Select           
#define DC0CN_VSEL__SHIFT       0x00 ///< DC-DC Converter Output Voltage Select           
#define DC0CN_VSEL__OUTPUT_1P8  0x00 ///< Target output voltage is 1.8 V.                 
#define DC0CN_VSEL__OUTPUT_1P9  0x01 ///< Target output voltage is 1.9 V.                 
#define DC0CN_VSEL__OUTPUT_2P0  0x02 ///< Target output voltage is 2.0 V.                 
#define DC0CN_VSEL__OUTPUT_2P1  0x03 ///< Target output voltage is 2.1 V.                 
#define DC0CN_VSEL__OUTPUT_2P4  0x04 ///< Target output voltage is 2.4 V.                 
#define DC0CN_VSEL__OUTPUT_2P7  0x05 ///< Target output voltage is 2.7 V.                 
#define DC0CN_VSEL__OUTPUT_3P0  0x06 ///< Target output voltage is 3.0 V.                 
#define DC0CN_VSEL__OUTPUT_3P3  0x07 ///< Target output voltage is 3.3 V.                 
                                                                                          
#define DC0CN_SYNC__BMASK       0x08 ///< ADC0 Synchronization Enable                     
#define DC0CN_SYNC__SHIFT       0x03 ///< ADC0 Synchronization Enable                     
#define DC0CN_SYNC__DISABLED    0x00 ///< The ADC is not synchronized to the dc-dc        
                                     ///< converter.                                      
#define DC0CN_SYNC__ENABLED     0x08 ///< The ADC is synchronized to the dc-dc converter. 
                                                                                          
#define DC0CN_SWSEL__BMASK      0x20 ///< DC-DC Converter Switch Select                   
#define DC0CN_SWSEL__SHIFT      0x05 ///< DC-DC Converter Switch Select                   
#define DC0CN_SWSEL__LARGE      0x00 ///< The large switches are selected (best efficiency
                                     ///< for high output currents).                      
#define DC0CN_SWSEL__SMALL      0x20 ///< The small switches are selected (best efficiency
                                     ///< for low output currents).                       
                                                                                          
#define DC0CN_MINPW__FMASK      0xC0 ///< DC-DC Converter Minimum Pulse Width             
#define DC0CN_MINPW__SHIFT      0x06 ///< DC-DC Converter Minimum Pulse Width             
#define DC0CN_MINPW__NO_MINIMUM 0x00 ///< No minimum duty cycle.                          
#define DC0CN_MINPW__20_NS      0x40 ///< Minimum pulse width is 20 ns.                   
#define DC0CN_MINPW__40_NS      0x80 ///< Minimum pulse width is 40 ns.                   
#define DC0CN_MINPW__80_NS      0xC0 ///< Minimum pulse width is 80 ns.                   
                                                                                          
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
